app/controllers/password_resets_controller.rb

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-07-27 16:42:00.272270"], ["password_digest", "[FILTERED]"], ["id", 1]]
UPDATE "users" SET "updated_at" = ?, "reset_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2025-05-31 13:47:25.066580"], ["reset_digest", nil], ["id", 102]]
---
  def update
        if params[:user][:password].empty?                # Case(2)
          @user.errors.add(:password, "can't be empty")
          render 'edit'
        elsif @user.update(user_params)                   # Case(3)
          log_in @user
          @user.update_attribute(:reset_digest, nil)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@prueba.com"], ["LIMIT", 1]]
---
  def get_user
    @user = User.find_by email: params[:email]