app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase) #params viene del form
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]