app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "remember_digest", "admin") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-04-25 23:38:49.878539"], ["password_digest", "[FILTERED]"], ["id", 950961012]]
---
  def update
    @user= User.find(params[:id])
    if @user.update(user_params)